// 49장 Babel과 Webpack을 이용한 ES6+/ES.NEXT 개발 환경 구축
// 49.1 Babel
// 49-01
// 49-02

// ____49.1.1 Babel 설치
// 49-03

// ____49.1.2 Babel 프리셋 설치와 babel.config.json 설정 파일 작성
// 49-04
// 49-05

// ____49.1.3 트랜스파일링
// 49-06
// 49-07

// ____49.1.4 Babel 플러그인 설치
// 49-08
// 49-09
// 49-10

// ____49.1.5 브라우저에서 모듈 로딩 테스트
// 49-11
// 49-12

// 49.2 Webpack
// ____49.2.1 Webpack 설치
// 49-13

// ____49.2.2 babel-loader 설치
// 49-14

// ____49.2.3 webpack.config.js 설정 파일 작성
// 49-15
// 49-16

// ____49.2.4 babel-polyfill 설치
// 49-17
// 49-18
// 49-19
// 49-20
// 49-21
