// 39장: DOM
// 39.1 노드
// ____39.1.1 HTML 요소와 노드 객체

// ____39.1.2 노드 객체의 타입

// ____39.1.3 노드 객체의 상속 구조

// 39.2 요소 노드 취득
// ____39.2.1 id를 이용한 요소 노드 취득
// ____39.2.2 태그 이름을 이용한 요소 노드 취득
// ____39.2.3 class를 이용한 요소 노드 취득
// ____39.2.4 CSS 선택자를 이용한 요소 노드 취득
// ____39.2.5 특정 요소 노드를 취득할 수 있는지 확인
// ____39.2.6 HTMLCollection과 NodeList

// 39.3 노드 탐색
// ____39.3.1 공백 텍스트 노드
// ____39.3.2 자식 노드 탐색
// ____39.3.3 자식 노드 존재 확인
// ____39.3.4 요소 노드의 텍스트 노드 탐색
// ____39.3.5 부모 노드 탐색
// ____39.3.6 형제 노드 탐색

// 39.4 노드 정보 취득

// 39.5 요소 노드의 텍스트 조작
// ____39.5.1 nodeValue
// ____39.5.2 textContent

// 39.6 DOM 조작
// ____39.6.1 innerHTML
// ____39.6.2 insertAdjacentHTML 메서드
// ____39.6.3 노드 생성과 추가
// ____39.6.4 복수의 노드 생성과 추가
// ____39.6.5 노드 삽입
// ____39.6.6 노드 이동
// ____39.6.7 노드 복사
// ____39.6.8 노드 교체
// ____39.6.9 노드 삭제

// 39.7 어트리뷰트
// ____39.7.1 어트리뷰트 노드와 attributes 프로퍼티
// ____39.7.2 HTML 어트리뷰트 조작
// ____39.7.3 HTML 어트리뷰트 vs. DOM 프로퍼티
// ____39.7.4 data 어트리뷰트와 dataset 프로퍼티

// 39.8 스타일
// ____39.8.1 인라인 스타일 조작
// ____39.8.2 클래스 조작
// ____39.8.3 요소에 적용되어 있는 CSS 스타일 참조

// 39.9 DOM 표준

// 39-99
