// 40장: 이벤트
// 40.1 이벤트 드리븐 프로그래밍
// 40.2 이벤트 타입
// ____40.2.1 마우스 이벤트
// ____40.2.2 키보드 이벤트
// ____40.2.3 포커스 이벤트
// ____40.2.4 폼 이벤트
// ____40.2.5 값 변경 이벤트
// ____40.2.6 DOM 뮤테이션 이벤트
// ____40.2.7 뷰 이벤트
// ____40.2.8 리소스 이벤트
// 40.3 이벤트 핸들러 등록
// ____40.3.1 이벤트 핸들러 어트리뷰트 방식
// ____40.3.2 이벤트 핸들러 프로퍼티 방식
// ____40.3.3 addEventListener 메서드 방식
// 40.4 이벤트 핸들러 제거
// 40.5 이벤트 객체
// ____40.5.1 이벤트 객체의 상속 구조
// ____40.5.2 이벤트 객체의 공통 프로퍼티
// ____40.5.3 마우스 정보 취득
// ____40.5.4 키보드 정보 취득
// 40.6 이벤트 전파
// 40.7 이벤트 위임
// 40.8 DOM 요소의 기본 동작의 조작
// ____40.8.1 DOM 요소의 기본 동작 중단
// ____40.8.2 이벤트 전파 방지
// 40.9 이벤트 핸들러 내부의 this
// ____40.9.1 이벤트 핸들러 어트리뷰트 방식
// ____40.9.2 이벤트 핸들러 프로퍼티 방식과 addEventListener 메서드 방식
// 40.10 이벤트 핸들러에 인수 전달
// 40.11 커스텀 이벤트
// ____40.11.1 커스텀 이벤트 생성
// ____40.11.2 커스텀 이벤트 디스패치

// 40-53
