//[예제풀이 15 -01]
var x = 1;
var y = 1;
//var 키워드로 선언된 변수는 같은 스코프 내에서 중복선언을 허용한다. 
//초화문이 있는 변수 선언문은 자바스크립트 엔진에 의해 var 키워드가 없느 ㄴ것처럼 동작한다. 
var x = 100;
//초기화문이 없는 변수선언문은 무시된다. 
var y;
console.log(x); //100
console.log(y); // 1 
//[예제풀이 15 -02]

//[예제풀이 15 -03]

//[예제풀이 15 -04]

//[예제풀이 15 -05]

//[예제풀이 15 -06]

//[예제풀이 15 -07]

//[예제풀이 15 -08]

//[예제풀이 15 -09]

//[예제풀이 15 -10]

//[예제풀이 15 -11]

//[예제풀이 15 -12]

//[예제풀이 15 -13]

//[예제풀이 15 -14]

//[예제풀이 15 -15]

//[예제풀이 15 -16]

//[예제풀이 15 -17]

//[예제풀이 15 -18]

//[예제풀이 15 -19]